In [1]:
import numpy as np 
import pandas as pd

In [2]:
data=pd.read_csv("TTrain.csv",delimiter=',')
data2=pd.read_csv("TTest.csv",delimiter=',')

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 14 columns):
pclass       1009 non-null float64
survived     1009 non-null float64
name         1009 non-null object
sex          1009 non-null object
age          812 non-null float64
sibsp        1009 non-null float64
parch        1009 non-null float64
ticket       1009 non-null object
fare         1008 non-null float64
cabin        229 non-null object
embarked     1008 non-null object
boat         374 non-null object
body         98 non-null float64
home.dest    582 non-null object
dtypes: float64(7), object(7)
memory usage: 110.4+ KB

In [4]:
columns_to_drop = ['name','ticket','cabin','embarked','boat']

data_clean = data.drop(columns_to_drop,axis=1)

In [5]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
data_clean["sex"] = le.fit_transform(data_clean["sex"])
data_clean.head()

,pclass,survived,sex,age,sibsp,parch,fare,body,home.dest
0,3.0,0.0,0,NaN,0.0,0.0,7.750,NaN,NaN
1,2.0,0.0,1,39.0,0.0,0.0,26.000,NaN,NaN
2,2.0,1.0,0,40.0,0.0,0.0,13.000,NaN,NaN
3,3.0,1.0,0,31.0,1.0,1.0,20.525,NaN,"Strood, Kent, England Detroit, MI"
4,3.0,1.0,0,NaN,2.0,0.0,23.250,NaN,NaN

In [6]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 13 columns):
pclass       300 non-null float64
name         300 non-null object
sex          300 non-null object
age          234 non-null float64
sibsp        300 non-null float64
parch        300 non-null float64
ticket       300 non-null object
fare         300 non-null float64
cabin        66 non-null object
embarked     299 non-null object
boat         112 non-null object
body         23 non-null float64
home.dest    163 non-null object
dtypes: float64(6), object(7)
memory usage: 30.5+ KB

In [7]:
columns_to_drop = ['name','ticket','cabin','embarked','boat']

data_clean2 = data2.drop(columns_to_drop,axis=1)

In [8]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
data_clean2["sex"] = le.fit_transform(data_clean2["sex"])

In [9]:
avg_age = data_clean["age"].mean()
print(avg_age)

29.838977832512317

In [10]:
data_clean = data_clean.fillna(avg_age)
data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 9 columns):
pclass       1009 non-null float64
survived     1009 non-null float64
sex          1009 non-null int32
age          1009 non-null float64
sibsp        1009 non-null float64
parch        1009 non-null float64
fare         1009 non-null float64
body         1009 non-null float64
home.dest    1009 non-null object
dtypes: float64(7), int32(1), object(1)
memory usage: 67.1+ KB

In [11]:
avg_age = data_clean2["age"].mean()
print(avg_age)
data_clean2 = data_clean2.fillna(avg_age)
data_clean2.info()

30.027421794871795
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 8 columns):
pclass       300 non-null float64
sex          300 non-null int32
age          300 non-null float64
sibsp        300 non-null float64
parch        300 non-null float64
fare         300 non-null float64
body         300 non-null float64
home.dest    300 non-null object
dtypes: float64(6), int32(1), object(1)
memory usage: 17.7+ KB

In [12]:
data_clean.head(10)

,pclass,survived,sex,age,sibsp,parch,fare,body,home.dest
0,3.0,0.0,0,29.838978,0.0,0.0,7.7500,29.838978,29.839
1,2.0,0.0,1,39.000000,0.0,0.0,26.0000,29.838978,29.839
2,2.0,1.0,0,40.000000,0.0,0.0,13.0000,29.838978,29.839
3,3.0,1.0,0,31.000000,1.0,1.0,20.5250,29.838978,"Strood, Kent, England Detroit, MI"
4,3.0,1.0,0,29.838978,2.0,0.0,23.2500,29.838978,29.839
5,2.0,0.0,1,16.000000,0.0,0.0,26.0000,29.838978,"Liverpool / Montreal, PQ"
6,2.0,0.0,1,43.000000,0.0,1.0,21.0000,29.838978,"Ilfracombe, Devon"
7,1.0,1.0,0,49.000000,0.0,0.0,25.9292,29.838978,"New York, NY"
8,1.0,0.0,1,48.000000,0.0,0.0,50.4958,208.000000,"Omaha, NE"
9,2.0,0.0,1,29.838978,0.0,0.0,12.8750,29.838978,29.839

In [13]:
data_clean2.head(10)

,pclass,sex,age,sibsp,parch,fare,body,home.dest
0,1.0,1,36.000000,0.0,0.0,26.3875,30.027422,"Brooklyn, NY"
1,3.0,0,30.027422,8.0,2.0,69.5500,30.027422,30.0274
2,1.0,1,30.027422,0.0,0.0,50.0000,30.027422,"Seattle, WA"
3,2.0,1,34.000000,0.0,0.0,13.0000,30.027422,"Vancouver, BC"
4,2.0,1,28.000000,0.0,0.0,13.0000,30.027422,"Helsinki, Finland Ashtabula, Ohio"
5,2.0,0,31.000000,1.0,1.0,26.2500,30.027422,"Bishopstoke, Hants / Fayette Valley, ID"
6,1.0,1,40.000000,0.0,0.0,27.7208,30.027422,"Mexico City, Mexico"
7,3.0,1,30.027422,0.0,0.0,7.2292,30.027422,30.0274
8,3.0,1,22.000000,0.0,0.0,8.0500,30.027422,30.0274
9,1.0,1,30.000000,0.0,0.0,45.5000,30.027422,"London / New York, NY"

In [36]:
z=np.array(data_clean)
x_train=z[:,:-1]
y_train=z[:,2]

In [40]:
x_train.shape

(1009, 8)

In [35]:
y_train.shape

(1009,)

In [37]:
from sklearn.tree import DecisionTreeClassifier
clf=DecisionTreeClassifier(criterion='entropy')
clf.fit(x_train,y_train)

ValueError: Unknown label type: 'unknown'

In [ ]:
y_pred=clf.predict(data_clean2) 
y=np.array(y_pred)
#y_test_pred=np.around(y,decimals=5)
np.savetxt("titanic.csv",y_pred,fmt="%d")